export interface Station {
    name: string;
    lat: number;
    lng: number;
    lines: string[];
}

export interface SubwayLine {
    id: string;
    name: string;
    color: string;
    stations: Station[];
}

export const SUBWAY_LINES: SubwayLine[] = [
    {
        "id": "1-Incheon",
        "name": "1호선",
        "color": "#0052A4",
        "stations": [
            {
                "name": "연천",
                "lat": 38.0963,
                "lng": 127.0747,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "청산",
                "lat": 38.0133,
                "lng": 127.0672,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "소요산",
                "lat": 37.9481,
                "lng": 127.061034,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "동두천",
                "lat": 37.927878,
                "lng": 127.05479,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "보산",
                "lat": 37.913702,
                "lng": 127.057277,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "동두천중앙",
                "lat": 37.901885,
                "lng": 127.056482,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "지행",
                "lat": 37.892334,
                "lng": 127.055716,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "덕정",
                "lat": 37.843188,
                "lng": 127.061277,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "덕계",
                "lat": 37.818486,
                "lng": 127.056486,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "양주",
                "lat": 37.774381,
                "lng": 127.044708,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "녹양",
                "lat": 37.75938,
                "lng": 127.042292,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "가능",
                "lat": 37.748577,
                "lng": 127.044213,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "의정부",
                "lat": 37.738415,
                "lng": 127.045958,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "회룡",
                "lat": 37.724846,
                "lng": 127.046895,
                "lines": [
                    "1호선",
                    "의정부경전철"
                ]
            },
            {
                "name": "망월사",
                "lat": 37.709914,
                "lng": 127.047455,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "도봉산",
                "lat": 37.689313,
                "lng": 127.046222,
                "lines": [
                    "1호선",
                    "7호선"
                ]
            },
            {
                "name": "도봉",
                "lat": 37.679563,
                "lng": 127.045595,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "방학",
                "lat": 37.667503,
                "lng": 127.044273,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "창동",
                "lat": 37.653166,
                "lng": 127.047731,
                "lines": [
                    "1호선",
                    "4호선"
                ]
            },
            {
                "name": "녹천",
                "lat": 37.644799,
                "lng": 127.051269,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "월계",
                "lat": 37.633212,
                "lng": 127.058831,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "광운대",
                "lat": 37.623632,
                "lng": 127.061835,
                "lines": [
                    "1호선",
                    "경춘선"
                ]
            },
            {
                "name": "석계",
                "lat": 37.614805,
                "lng": 127.065851,
                "lines": [
                    "1호선",
                    "6호선"
                ]
            },
            {
                "name": "신이문",
                "lat": 37.601854,
                "lng": 127.067325,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "외대앞",
                "lat": 37.596073,
                "lng": 127.063549,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "회기",
                "lat": 37.58946,
                "lng": 127.057583,
                "lines": [
                    "1호선",
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "청량리",
                "lat": 37.580178,
                "lng": 127.046835,
                "lines": [
                    "1호선",
                    "경의중앙선",
                    "경춘선",
                    "수인분당선"
                ]
            },
            {
                "name": "제기동",
                "lat": 37.578103,
                "lng": 127.034893,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "신설동",
                "lat": 37.575297,
                "lng": 127.025087,
                "lines": [
                    "1호선",
                    "2호선",
                    "우이신설선"
                ]
            },
            {
                "name": "동묘앞",
                "lat": 37.572627,
                "lng": 127.016429,
                "lines": [
                    "1호선",
                    "6호선"
                ]
            },
            {
                "name": "동대문",
                "lat": 37.57142,
                "lng": 127.009745,
                "lines": [
                    "1호선",
                    "4호선"
                ]
            },
            {
                "name": "종로5가",
                "lat": 37.570926,
                "lng": 127.001849,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "종로3가",
                "lat": 37.571607,
                "lng": 126.991806,
                "lines": [
                    "1호선",
                    "3호선",
                    "5호선"
                ]
            },
            {
                "name": "종각",
                "lat": 37.570161,
                "lng": 126.982923,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "시청",
                "lat": 37.564718,
                "lng": 126.977108,
                "lines": [
                    "1호선",
                    "2호선"
                ]
            },
            {
                "name": "서울",
                "lat": 37.554648,
                "lng": 126.972559,
                "lines": [
                    "1호선",
                    "4호선",
                    "경의중앙선",
                    "공항철도",
                    "GTX-A"
                ]
            },
            {
                "name": "남영",
                "lat": 37.541021,
                "lng": 126.9713,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "용산",
                "lat": 37.529849,
                "lng": 126.964561,
                "lines": [
                    "1호선",
                    "경의중앙선"
                ]
            },
            {
                "name": "노량진",
                "lat": 37.514219,
                "lng": 126.942454,
                "lines": [
                    "1호선",
                    "9호선"
                ]
            },
            {
                "name": "대방",
                "lat": 37.513342,
                "lng": 126.926382,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "신길",
                "lat": 37.517122,
                "lng": 126.917169,
                "lines": [
                    "1호선",
                    "5호선"
                ]
            },
            {
                "name": "영등포",
                "lat": 37.515504,
                "lng": 126.907628,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "신도림",
                "lat": 37.508725,
                "lng": 126.891295,
                "lines": [
                    "1호선",
                    "2호선"
                ]
            },
            {
                "name": "구로",
                "lat": 37.503039,
                "lng": 126.881966,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "구일",
                "lat": 37.496756,
                "lng": 126.870793,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "개봉",
                "lat": 37.494594,
                "lng": 126.85868,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "오류동",
                "lat": 37.494526,
                "lng": 126.845365,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "온수",
                "lat": 37.492258,
                "lng": 126.823388,
                "lines": [
                    "1호선",
                    "7호선"
                ]
            },
            {
                "name": "역곡",
                "lat": 37.485178,
                "lng": 126.811502,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "소사",
                "lat": 37.482753,
                "lng": 126.79544,
                "lines": [
                    "1호선",
                    "서해선"
                ]
            },
            {
                "name": "부천",
                "lat": 37.48405,
                "lng": 126.782686,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "중동",
                "lat": 37.486562,
                "lng": 126.764843,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "송내",
                "lat": 37.4876,
                "lng": 126.753664,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "부개",
                "lat": 37.488418,
                "lng": 126.74109,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "부평",
                "lat": 37.489493,
                "lng": 126.724805,
                "lines": [
                    "1호선",
                    "인천선"
                ]
            },
            {
                "name": "백운",
                "lat": 37.483664,
                "lng": 126.707704,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "동암",
                "lat": 37.471408,
                "lng": 126.702896,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "간석",
                "lat": 37.464737,
                "lng": 126.694181,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "주안",
                "lat": 37.464941,
                "lng": 126.679923,
                "lines": [
                    "1호선",
                    "인천2호선"
                ]
            },
            {
                "name": "도화",
                "lat": 37.46607,
                "lng": 126.668672,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "제물포",
                "lat": 37.466769,
                "lng": 126.656666,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "도원",
                "lat": 37.468446,
                "lng": 126.642706,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "동인천",
                "lat": 37.475276,
                "lng": 126.632802,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "인천",
                "lat": 37.476691,
                "lng": 126.616936,
                "lines": [
                    "1호선",
                    "수인분당선"
                ]
            }
        ]
    },
    {
        "id": "1-Sinchang",
        "name": "1호선",
        "color": "#0052A4",
        "stations": [
            {
                "name": "구로",
                "lat": 37.503039,
                "lng": 126.881966,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "가산디지털단지",
                "lat": 37.481072,
                "lng": 126.882343,
                "lines": [
                    "1호선",
                    "7호선"
                ]
            },
            {
                "name": "독산",
                "lat": 37.466613,
                "lng": 126.889249,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "금천구청",
                "lat": 37.455626,
                "lng": 126.89398,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "석수",
                "lat": 37.435047,
                "lng": 126.902295,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "관악",
                "lat": 37.419232,
                "lng": 126.908706,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "안양",
                "lat": 37.401592,
                "lng": 126.922874,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "명학",
                "lat": 37.384653,
                "lng": 126.935433,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "금정",
                "lat": 37.372221,
                "lng": 126.943429,
                "lines": [
                    "1호선",
                    "4호선"
                ]
            },
            {
                "name": "군포",
                "lat": 37.35356,
                "lng": 126.948462,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "당정",
                "lat": 37.344285,
                "lng": 126.948345,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "의왕",
                "lat": 37.320852,
                "lng": 126.948217,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "성균관대",
                "lat": 37.300349,
                "lng": 126.97075,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "화서",
                "lat": 37.283862,
                "lng": 126.989627,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "수원",
                "lat": 37.265974,
                "lng": 126.999874,
                "lines": [
                    "1호선",
                    "수인분당선"
                ]
            },
            {
                "name": "세류",
                "lat": 37.245025,
                "lng": 127.013222,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "병점",
                "lat": 37.207503,
                "lng": 127.032731,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "서동탄",
                "lat": 37.195504,
                "lng": 127.051672,
                "lines": [
                    "1호선"
                ]
            }
        ]
    },
    {
        "id": "1-Cheonan",
        "name": "1호선",
        "color": "#0052A4",
        "stations": [
            {
                "name": "병점",
                "lat": 37.207503,
                "lng": 127.032731,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "세마",
                "lat": 37.187533,
                "lng": 127.04318,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "오산대",
                "lat": 37.168953,
                "lng": 127.063197,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "오산",
                "lat": 37.145885,
                "lng": 127.06672,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "진위",
                "lat": 37.109447,
                "lng": 127.062278,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "송탄",
                "lat": 37.075696,
                "lng": 127.054301,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "서정리",
                "lat": 37.056496,
                "lng": 127.052819,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "지제",
                "lat": 37.0188,
                "lng": 127.070444,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "평택",
                "lat": 36.990726,
                "lng": 127.085159,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "성환",
                "lat": 36.916076,
                "lng": 127.126964,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "직산",
                "lat": 36.870593,
                "lng": 127.143904,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "두정",
                "lat": 36.833705,
                "lng": 127.14896,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "천안",
                "lat": 36.810005,
                "lng": 127.146826,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "봉명",
                "lat": 36.801215,
                "lng": 127.135763,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "쌍용",
                "lat": 36.793759,
                "lng": 127.1214,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "아산",
                "lat": 36.792053,
                "lng": 127.104361,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "배방",
                "lat": 36.777629,
                "lng": 127.052991,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "온양온천",
                "lat": 36.780483,
                "lng": 127.003249,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "신창",
                "lat": 36.769502,
                "lng": 126.951108,
                "lines": [
                    "1호선"
                ]
            }
        ]
    },
    {
        "id": "1-Gwangmyeong",
        "name": "1호선",
        "color": "#0052A4",
        "stations": [
            {
                "name": "금천구청",
                "lat": 37.455626,
                "lng": 126.89398,
                "lines": [
                    "1호선"
                ]
            },
            {
                "name": "광명",
                "lat": 37.416182,
                "lng": 126.884466,
                "lines": [
                    "1호선"
                ]
            }
        ]
    },
    {
        "id": "2-Loop",
        "name": "2호선",
        "color": "#3CB44B",
        "stations": [
            {
                "name": "시청",
                "lat": 37.564718,
                "lng": 126.977108,
                "lines": [
                    "1호선",
                    "2호선"
                ]
            },
            {
                "name": "을지로입구",
                "lat": 37.566014,
                "lng": 126.982618,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "을지로3가",
                "lat": 37.566295,
                "lng": 126.99191,
                "lines": [
                    "2호선",
                    "3호선"
                ]
            },
            {
                "name": "을지로4가",
                "lat": 37.566941,
                "lng": 126.998079,
                "lines": [
                    "2호선",
                    "5호선"
                ]
            },
            {
                "name": "동대문역사문화공원",
                "lat": 37.565138,
                "lng": 127.007896,
                "lines": [
                    "2호선",
                    "4호선",
                    "5호선"
                ]
            },
            {
                "name": "신당",
                "lat": 37.565972,
                "lng": 127.01782,
                "lines": [
                    "2호선",
                    "6호선"
                ]
            },
            {
                "name": "상왕십리",
                "lat": 37.564354,
                "lng": 127.029354,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "왕십리",
                "lat": 37.561533,
                "lng": 127.037732,
                "lines": [
                    "2호선",
                    "5호선",
                    "경의중앙선",
                    "수인분당선"
                ]
            },
            {
                "name": "한양대",
                "lat": 37.555273,
                "lng": 127.043655,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "뚝섬",
                "lat": 37.547184,
                "lng": 127.047367,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "성수",
                "lat": 37.544581,
                "lng": 127.055961,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "건대입구",
                "lat": 37.540693,
                "lng": 127.07023,
                "lines": [
                    "2호선",
                    "7호선"
                ]
            },
            {
                "name": "구의",
                "lat": 37.537077,
                "lng": 127.085916,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "강변",
                "lat": 37.535095,
                "lng": 127.094681,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "잠실나루",
                "lat": 37.520733,
                "lng": 127.10379,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "잠실",
                "lat": 37.51395,
                "lng": 127.102234,
                "lines": [
                    "2호선",
                    "8호선"
                ]
            },
            {
                "name": "잠실새내",
                "lat": 37.511687,
                "lng": 127.086162,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "종합운동장",
                "lat": 37.510997,
                "lng": 127.073642,
                "lines": [
                    "2호선",
                    "9호선"
                ]
            },
            {
                "name": "삼성",
                "lat": 37.508844,
                "lng": 127.06316,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "선릉",
                "lat": 37.504503,
                "lng": 127.049008,
                "lines": [
                    "2호선",
                    "수인분당선"
                ]
            },
            {
                "name": "역삼",
                "lat": 37.500622,
                "lng": 127.036456,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "강남",
                "lat": 37.497175,
                "lng": 127.027926,
                "lines": [
                    "2호선",
                    "신분당선"
                ]
            },
            {
                "name": "교대",
                "lat": 37.493415,
                "lng": 127.01408,
                "lines": [
                    "2호선",
                    "3호선"
                ]
            },
            {
                "name": "서초",
                "lat": 37.491897,
                "lng": 127.007917,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "방배",
                "lat": 37.481426,
                "lng": 126.997596,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "사당",
                "lat": 37.47653,
                "lng": 126.981685,
                "lines": [
                    "2호선",
                    "4호선"
                ]
            },
            {
                "name": "낙성대",
                "lat": 37.47693,
                "lng": 126.963693,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "서울대입구",
                "lat": 37.481247,
                "lng": 126.952739,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "봉천",
                "lat": 37.482362,
                "lng": 126.941892,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "신림",
                "lat": 37.484200,
                "lng": 126.929500,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "신대방",
                "lat": 37.487462,
                "lng": 126.913149,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "구로디지털단지",
                "lat": 37.485266,
                "lng": 126.901401,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "대림",
                "lat": 37.49297,
                "lng": 126.895801,
                "lines": [
                    "2호선",
                    "7호선"
                ]
            },
            {
                "name": "신도림",
                "lat": 37.508725,
                "lng": 126.891295,
                "lines": [
                    "1호선",
                    "2호선"
                ]
            },
            {
                "name": "문래",
                "lat": 37.517933,
                "lng": 126.89476,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "영등포구청",
                "lat": 37.52497,
                "lng": 126.895951,
                "lines": [
                    "2호선",
                    "5호선"
                ]
            },
            {
                "name": "당산",
                "lat": 37.53438,
                "lng": 126.902281,
                "lines": [
                    "2호선",
                    "9호선"
                ]
            },
            {
                "name": "합정",
                "lat": 37.549463,
                "lng": 126.913739,
                "lines": [
                    "2호선",
                    "6호선"
                ]
            },
            {
                "name": "홍대입구",
                "lat": 37.557192,
                "lng": 126.925381,
                "lines": [
                    "2호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "신촌(2호선)",
                "lat": 37.555134,
                "lng": 126.936893,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "이대",
                "lat": 37.556733,
                "lng": 126.946013,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "아현",
                "lat": 37.557345,
                "lng": 126.956141,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "충정로",
                "lat": 37.559973,
                "lng": 126.963672,
                "lines": [
                    "2호선",
                    "5호선"
                ]
            },
            {
                "name": "시청",
                "lat": 37.564718,
                "lng": 126.977108,
                "lines": [
                    "1호선",
                    "2호선"
                ]
            }
        ]
    },
    {
        "id": "2-Seongsu",
        "name": "2호선",
        "color": "#3CB44B",
        "stations": [
            {
                "name": "성수",
                "lat": 37.544581,
                "lng": 127.055961,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "용답",
                "lat": 37.561904,
                "lng": 127.050899,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "신답",
                "lat": 37.57004,
                "lng": 127.046481,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "용두",
                "lat": 37.574028,
                "lng": 127.038091,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "신설동",
                "lat": 37.575297,
                "lng": 127.025087,
                "lines": [
                    "1호선",
                    "2호선",
                    "우이신설선"
                ]
            }
        ]
    },
    {
        "id": "2-Sinjeong",
        "name": "2호선",
        "color": "#3CB44B",
        "stations": [
            {
                "name": "신도림",
                "lat": 37.508725,
                "lng": 126.891295,
                "lines": [
                    "1호선",
                    "2호선"
                ]
            },
            {
                "name": "도림천",
                "lat": 37.514287,
                "lng": 126.882768,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "양천구청",
                "lat": 37.512398,
                "lng": 126.865819,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "신정네거리",
                "lat": 37.520074,
                "lng": 126.852912,
                "lines": [
                    "2호선"
                ]
            },
            {
                "name": "까치산",
                "lat": 37.531768,
                "lng": 126.846683,
                "lines": [
                    "2호선",
                    "5호선"
                ]
            }
        ]
    },
    {
        "id": "3",
        "name": "3호선",
        "color": "#EF7C1C",
        "stations": [
            {
                "name": "대화",
                "lat": 37.676087,
                "lng": 126.747569,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "주엽",
                "lat": 37.670072,
                "lng": 126.761334,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "정발산",
                "lat": 37.659477,
                "lng": 126.773359,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "마두",
                "lat": 37.652206,
                "lng": 126.77762,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "백석",
                "lat": 37.643114,
                "lng": 126.78787,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "대곡",
                "lat": 37.631626,
                "lng": 126.811024,
                "lines": [
                    "3호선",
                    "경의중앙선",
                    "GTX-A"
                ]
            },
            {
                "name": "화정",
                "lat": 37.634592,
                "lng": 126.83265,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "원당",
                "lat": 37.653324,
                "lng": 126.843041,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "원흥",
                "lat": 37.650658,
                "lng": 126.872642,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "삼송",
                "lat": 37.653083,
                "lng": 126.895558,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "지축",
                "lat": 37.648048,
                "lng": 126.913951,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "구파발",
                "lat": 37.636763,
                "lng": 126.918821,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "연신내",
                "lat": 37.619001,
                "lng": 126.921008,
                "lines": [
                    "3호선",
                    "6호선",
                    "GTX-A"
                ]
            },
            {
                "name": "불광",
                "lat": 37.610469,
                "lng": 126.929887,
                "lines": [
                    "3호선",
                    "6호선"
                ]
            },
            {
                "name": "녹번",
                "lat": 37.600927,
                "lng": 126.935756,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "홍제",
                "lat": 37.589066,
                "lng": 126.943736,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "무악재",
                "lat": 37.582299,
                "lng": 126.950291,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "독립문",
                "lat": 37.574571,
                "lng": 126.957748,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "경복궁",
                "lat": 37.575762,
                "lng": 126.97353,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "안국",
                "lat": 37.576477,
                "lng": 126.985443,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "종로3가",
                "lat": 37.571607,
                "lng": 126.991806,
                "lines": [
                    "1호선",
                    "3호선",
                    "5호선"
                ]
            },
            {
                "name": "을지로3가",
                "lat": 37.566295,
                "lng": 126.99191,
                "lines": [
                    "2호선",
                    "3호선"
                ]
            },
            {
                "name": "충무로",
                "lat": 37.561243,
                "lng": 126.99428,
                "lines": [
                    "3호선",
                    "4호선"
                ]
            },
            {
                "name": "동대입구",
                "lat": 37.559052,
                "lng": 127.005602,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "약수",
                "lat": 37.55434,
                "lng": 127.010655,
                "lines": [
                    "3호선",
                    "6호선"
                ]
            },
            {
                "name": "금호",
                "lat": 37.548034,
                "lng": 127.015872,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "옥수",
                "lat": 37.540685,
                "lng": 127.017965,
                "lines": [
                    "3호선",
                    "경의중앙선"
                ]
            },
            {
                "name": "압구정",
                "lat": 37.527072,
                "lng": 127.028461,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "신사",
                "lat": 37.516334,
                "lng": 127.020114,
                "lines": [
                    "3호선",
                    "신분당선"
                ]
            },
            {
                "name": "잠원",
                "lat": 37.512759,
                "lng": 127.01122,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "고속터미널",
                "lat": 37.50481,
                "lng": 127.004943,
                "lines": [
                    "3호선",
                    "7호선",
                    "9호선"
                ]
            },
            {
                "name": "교대",
                "lat": 37.493415,
                "lng": 127.01408,
                "lines": [
                    "2호선",
                    "3호선"
                ]
            },
            {
                "name": "남부터미널",
                "lat": 37.485013,
                "lng": 127.016189,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "양재",
                "lat": 37.484147,
                "lng": 127.034631,
                "lines": [
                    "3호선",
                    "신분당선"
                ]
            },
            {
                "name": "매봉",
                "lat": 37.486947,
                "lng": 127.046769,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "도곡",
                "lat": 37.490858,
                "lng": 127.055381,
                "lines": [
                    "3호선",
                    "수인분당선"
                ]
            },
            {
                "name": "대치",
                "lat": 37.494612,
                "lng": 127.063642,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "학여울",
                "lat": 37.496663,
                "lng": 127.070594,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "대청",
                "lat": 37.493514,
                "lng": 127.079532,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "일원",
                "lat": 37.483681,
                "lng": 127.08439,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "수서",
                "lat": 37.487371,
                "lng": 127.10188,
                "lines": [
                    "3호선",
                    "수인분당선",
                    "GTX-A"
                ]
            },
            {
                "name": "가락시장",
                "lat": 37.492522,
                "lng": 127.118234,
                "lines": [
                    "3호선",
                    "8호선"
                ]
            },
            {
                "name": "경찰병원",
                "lat": 37.495918,
                "lng": 127.12454,
                "lines": [
                    "3호선"
                ]
            },
            {
                "name": "오금",
                "lat": 37.502162,
                "lng": 127.128111,
                "lines": [
                    "3호선",
                    "5호선"
                ]
            }
        ]
    },
    {
        "id": "4",
        "name": "4호선",
        "color": "#00A5DE",
        "stations": [
            {
                "name": "진접",
                "lat": 37.7195,
                "lng": 127.2033,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "오남",
                "lat": 37.7055,
                "lng": 127.1917,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "별내별가람",
                "lat": 37.6676,
                "lng": 127.1155,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "당고개",
                "lat": 37.670272,
                "lng": 127.079066,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "상계",
                "lat": 37.660878,
                "lng": 127.073572,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "노원",
                "lat": 37.655128,
                "lng": 127.061368,
                "lines": [
                    "4호선",
                    "7호선"
                ]
            },
            {
                "name": "창동",
                "lat": 37.653166,
                "lng": 127.047731,
                "lines": [
                    "1호선",
                    "4호선"
                ]
            },
            {
                "name": "쌍문",
                "lat": 37.648627,
                "lng": 127.034709,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "수유",
                "lat": 37.638052,
                "lng": 127.025732,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "미아",
                "lat": 37.62667,
                "lng": 127.025983,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "미아사거리",
                "lat": 37.613292,
                "lng": 127.030053,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "길음",
                "lat": 37.603407,
                "lng": 127.025053,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "성신여대입구",
                "lat": 37.592624,
                "lng": 127.016403,
                "lines": [
                    "4호선",
                    "우이신설선"
                ]
            },
            {
                "name": "한성대입구",
                "lat": 37.588458,
                "lng": 127.006221,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "혜화",
                "lat": 37.582336,
                "lng": 127.001844,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "동대문",
                "lat": 37.57142,
                "lng": 127.009745,
                "lines": [
                    "1호선",
                    "4호선"
                ]
            },
            {
                "name": "동대문역사문화공원",
                "lat": 37.565138,
                "lng": 127.007896,
                "lines": [
                    "2호선",
                    "4호선",
                    "5호선"
                ]
            },
            {
                "name": "충무로",
                "lat": 37.561243,
                "lng": 126.99428,
                "lines": [
                    "3호선",
                    "4호선"
                ]
            },
            {
                "name": "명동",
                "lat": 37.560989,
                "lng": 126.986325,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "회현",
                "lat": 37.558514,
                "lng": 126.978246,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "서울",
                "lat": 37.554648,
                "lng": 126.972559,
                "lines": [
                    "1호선",
                    "4호선",
                    "경의중앙선",
                    "공항철도",
                    "GTX-A"
                ]
            },
            {
                "name": "숙대입구",
                "lat": 37.54456,
                "lng": 126.972106,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "삼각지",
                "lat": 37.534777,
                "lng": 126.97311,
                "lines": [
                    "4호선",
                    "6호선"
                ]
            },
            {
                "name": "신용산",
                "lat": 37.52917,
                "lng": 126.967894,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "이촌",
                "lat": 37.522272,
                "lng": 126.974345,
                "lines": [
                    "4호선",
                    "경의중앙선"
                ]
            },
            {
                "name": "동작",
                "lat": 37.502971,
                "lng": 126.979306,
                "lines": [
                    "4호선",
                    "9호선"
                ]
            },
            {
                "name": "이수(총신대)",
                "lat": 37.486263,
                "lng": 126.981989,
                "lines": [
                    "4호선",
                    "7호선"
                ]
            },
            {
                "name": "사당",
                "lat": 37.47653,
                "lng": 126.981685,
                "lines": [
                    "2호선",
                    "4호선"
                ]
            },
            {
                "name": "남태령",
                "lat": 37.463873,
                "lng": 126.989134,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "선바위",
                "lat": 37.451673,
                "lng": 127.002303,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "경마공원",
                "lat": 37.443885,
                "lng": 127.007888,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "대공원",
                "lat": 37.435675,
                "lng": 127.006523,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "과천",
                "lat": 37.433021,
                "lng": 126.996568,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "정부과천청사",
                "lat": 37.426513,
                "lng": 126.98978,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "인덕원",
                "lat": 37.401553,
                "lng": 126.976715,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "평촌",
                "lat": 37.394287,
                "lng": 126.963883,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "범계",
                "lat": 37.389793,
                "lng": 126.950806,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "금정",
                "lat": 37.372221,
                "lng": 126.943429,
                "lines": [
                    "1호선",
                    "4호선"
                ]
            },
            {
                "name": "산본",
                "lat": 37.358101,
                "lng": 126.933274,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "수리산",
                "lat": 37.349801,
                "lng": 126.925365,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "대야미",
                "lat": 37.328467,
                "lng": 126.917332,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "반월",
                "lat": 37.312212,
                "lng": 126.903524,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "상록수",
                "lat": 37.302795,
                "lng": 126.866489,
                "lines": [
                    "4호선"
                ]
            },
            {
                "name": "한대앞",
                "lat": 37.309689,
                "lng": 126.85344,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "중앙",
                "lat": 37.315941,
                "lng": 126.838573,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "고잔",
                "lat": 37.316777,
                "lng": 126.823249,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "초지",
                "lat": 37.320646,
                "lng": 126.805913,
                "lines": [
                    "4호선",
                    "서해선",
                    "수인분당선"
                ]
            },
            {
                "name": "안산",
                "lat": 37.327082,
                "lng": 126.788532,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "신길온천",
                "lat": 37.338212,
                "lng": 126.765844,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "정왕",
                "lat": 37.351735,
                "lng": 126.742989,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "오이도",
                "lat": 37.362357,
                "lng": 126.738714,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            }
        ]
    },
    {
        "id": "5-Hanam",
        "name": "5호선",
        "color": "#996CAC",
        "stations": [
            {
                "name": "방화",
                "lat": 37.577446,
                "lng": 126.812741,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "개화산",
                "lat": 37.572399,
                "lng": 126.806171,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "김포공항",
                "lat": 37.562434,
                "lng": 126.801058,
                "lines": [
                    "5호선",
                    "9호선",
                    "공항철도",
                    "김포도시철도"
                ]
            },
            {
                "name": "송정",
                "lat": 37.561184,
                "lng": 126.811973,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "마곡",
                "lat": 37.560183,
                "lng": 126.825448,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "발산",
                "lat": 37.558598,
                "lng": 126.837668,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "우장산",
                "lat": 37.548768,
                "lng": 126.836318,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "화곡",
                "lat": 37.541513,
                "lng": 126.840461,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "까치산",
                "lat": 37.531768,
                "lng": 126.846683,
                "lines": [
                    "2호선",
                    "5호선"
                ]
            },
            {
                "name": "신정",
                "lat": 37.524997,
                "lng": 126.856191,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "목동",
                "lat": 37.526065,
                "lng": 126.864931,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "오목교",
                "lat": 37.524496,
                "lng": 126.875181,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "양평(5호선)",
                "lat": 37.5255688472834,
                "lng": 126.88643626847433,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "영등포구청",
                "lat": 37.52497,
                "lng": 126.895951,
                "lines": [
                    "2호선",
                    "5호선"
                ]
            },
            {
                "name": "영등포시장",
                "lat": 37.522669,
                "lng": 126.905139,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "신길",
                "lat": 37.517122,
                "lng": 126.917169,
                "lines": [
                    "1호선",
                    "5호선"
                ]
            },
            {
                "name": "여의도",
                "lat": 37.521569,
                "lng": 126.924256,
                "lines": [
                    "5호선",
                    "9호선"
                ]
            },
            {
                "name": "여의나루",
                "lat": 37.527098,
                "lng": 126.932901,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "마포",
                "lat": 37.539574,
                "lng": 126.945932,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "공덕",
                "lat": 37.544018,
                "lng": 126.951592,
                "lines": [
                    "5호선",
                    "6호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "애오개",
                "lat": 37.553736,
                "lng": 126.95682,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "충정로",
                "lat": 37.559973,
                "lng": 126.963672,
                "lines": [
                    "2호선",
                    "5호선"
                ]
            },
            {
                "name": "서대문",
                "lat": 37.565773,
                "lng": 126.966641,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "광화문",
                "lat": 37.571026,
                "lng": 126.976669,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "종로3가",
                "lat": 37.571607,
                "lng": 126.991806,
                "lines": [
                    "1호선",
                    "3호선",
                    "5호선"
                ]
            },
            {
                "name": "을지로4가",
                "lat": 37.566941,
                "lng": 126.998079,
                "lines": [
                    "2호선",
                    "5호선"
                ]
            },
            {
                "name": "동대문역사문화공원",
                "lat": 37.565138,
                "lng": 127.007896,
                "lines": [
                    "2호선",
                    "4호선",
                    "5호선"
                ]
            },
            {
                "name": "청구",
                "lat": 37.560245,
                "lng": 127.013828,
                "lines": [
                    "5호선",
                    "6호선"
                ]
            },
            {
                "name": "신금호",
                "lat": 37.554548,
                "lng": 127.020331,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "행당",
                "lat": 37.557322,
                "lng": 127.029476,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "왕십리",
                "lat": 37.561533,
                "lng": 127.037732,
                "lines": [
                    "2호선",
                    "5호선",
                    "경의중앙선",
                    "수인분당선"
                ]
            },
            {
                "name": "마장",
                "lat": 37.5661,
                "lng": 127.042973,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "답십리",
                "lat": 37.566747,
                "lng": 127.052704,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "장한평",
                "lat": 37.56144,
                "lng": 127.064623,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "군자",
                "lat": 37.557121,
                "lng": 127.079542,
                "lines": [
                    "5호선",
                    "7호선"
                ]
            },
            {
                "name": "아차산",
                "lat": 37.551691,
                "lng": 127.089761,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "광나루",
                "lat": 37.545303,
                "lng": 127.10357,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "천호",
                "lat": 37.538397,
                "lng": 127.123572,
                "lines": [
                    "5호선",
                    "8호선"
                ]
            },
            {
                "name": "강동",
                "lat": 37.535804,
                "lng": 127.132481,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "길동",
                "lat": 37.537801,
                "lng": 127.140004,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "굽은다리",
                "lat": 37.545477,
                "lng": 127.142853,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "명일",
                "lat": 37.55137,
                "lng": 127.143999,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "고덕",
                "lat": 37.555004,
                "lng": 127.154151,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "상일동",
                "lat": 37.556712,
                "lng": 127.166417,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "강일",
                "lat": 37.557428744877704,
                "lng": 127.17563831477813,
                "lines": [
                    "5호선",
                    "5호선"
                ]
            },
            {
                "name": "미사",
                "lat": 37.561468,
                "lng": 127.1911413,
                "lines": [
                    "5호선",
                    "5호선"
                ]
            },
            {
                "name": "하남풍산",
                "lat": 37.5520632,
                "lng": 127.201686,
                "lines": [
                    "5호선",
                    "5호선"
                ]
            },
            {
                "name": "하남시청",
                "lat": 37.54196308251825,
                "lng": 127.2063060431385,
                "lines": [
                    "5호선",
                    "5호선"
                ]
            },
            {
                "name": "하남검단산",
                "lat": 37.5397789222209,
                "lng": 127.22322718521292,
                "lines": [
                    "5호선",
                    "5호선"
                ]
            }
        ]
    },
    {
        "id": "5-Macheon",
        "name": "5호선",
        "color": "#996CAC",
        "stations": [
            {
                "name": "강동",
                "lat": 37.535804,
                "lng": 127.132481,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "둔촌동",
                "lat": 37.527788,
                "lng": 127.136248,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "올림픽공원",
                "lat": 37.516078,
                "lng": 127.130848,
                "lines": [
                    "5호선",
                    "9호선"
                ]
            },
            {
                "name": "방이",
                "lat": 37.508857,
                "lng": 127.126133,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "오금",
                "lat": 37.502162,
                "lng": 127.128111,
                "lines": [
                    "3호선",
                    "5호선"
                ]
            },
            {
                "name": "개롱",
                "lat": 37.498079,
                "lng": 127.13482,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "거여",
                "lat": 37.493105,
                "lng": 127.14415,
                "lines": [
                    "5호선"
                ]
            },
            {
                "name": "마천",
                "lat": 37.49499,
                "lng": 127.152781,
                "lines": [
                    "5호선"
                ]
            }
        ]
    },
    {
        "id": "6",
        "name": "6호선",
        "color": "#CD7C2F",
        "stations": [
            {
                "name": "응암",
                "lat": 37.598605,
                "lng": 126.915577,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "구산",
                "lat": 37.611377,
                "lng": 126.91727,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "연신내",
                "lat": 37.619001,
                "lng": 126.921008,
                "lines": [
                    "3호선",
                    "6호선",
                    "GTX-A"
                ]
            },
            {
                "name": "독바위",
                "lat": 37.618456,
                "lng": 126.933031,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "연신내",
                "lat": 37.619001,
                "lng": 126.921008,
                "lines": [
                    "3호선",
                    "6호선",
                    "GTX-A"
                ]
            },
            {
                "name": "구산",
                "lat": 37.611377,
                "lng": 126.91727,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "응암",
                "lat": 37.598605,
                "lng": 126.915577,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "새절",
                "lat": 37.591148,
                "lng": 126.913629,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "증산",
                "lat": 37.583876,
                "lng": 126.909645,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "디지털미디어시티",
                "lat": 37.576646,
                "lng": 126.900984,
                "lines": [
                    "6호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "월드컵경기장",
                "lat": 37.569532,
                "lng": 126.899298,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "마포구청",
                "lat": 37.563515,
                "lng": 126.903343,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "망원",
                "lat": 37.556094,
                "lng": 126.910052,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "합정",
                "lat": 37.549463,
                "lng": 126.913739,
                "lines": [
                    "2호선",
                    "6호선"
                ]
            },
            {
                "name": "상수",
                "lat": 37.547716,
                "lng": 126.922852,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "광흥창",
                "lat": 37.547456,
                "lng": 126.931993,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "대흥",
                "lat": 37.547771,
                "lng": 126.942069,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "공덕",
                "lat": 37.544018,
                "lng": 126.951592,
                "lines": [
                    "5호선",
                    "6호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "효창공원앞",
                "lat": 37.539261,
                "lng": 126.961351,
                "lines": [
                    "6호선",
                    "경의중앙선"
                ]
            },
            {
                "name": "삼각지",
                "lat": 37.534777,
                "lng": 126.97311,
                "lines": [
                    "4호선",
                    "6호선"
                ]
            },
            {
                "name": "녹사평",
                "lat": 37.534675,
                "lng": 126.986695,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "이태원",
                "lat": 37.534488,
                "lng": 126.994302,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "한강진",
                "lat": 37.539631,
                "lng": 127.001725,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "버티고개",
                "lat": 37.548013,
                "lng": 127.007055,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "약수",
                "lat": 37.55434,
                "lng": 127.010655,
                "lines": [
                    "3호선",
                    "6호선"
                ]
            },
            {
                "name": "청구",
                "lat": 37.560245,
                "lng": 127.013828,
                "lines": [
                    "5호선",
                    "6호선"
                ]
            },
            {
                "name": "신당",
                "lat": 37.565972,
                "lng": 127.01782,
                "lines": [
                    "2호선",
                    "6호선"
                ]
            },
            {
                "name": "동묘앞",
                "lat": 37.572627,
                "lng": 127.016429,
                "lines": [
                    "1호선",
                    "6호선"
                ]
            },
            {
                "name": "창신",
                "lat": 37.579661,
                "lng": 127.015241,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "보문",
                "lat": 37.585286,
                "lng": 127.019381,
                "lines": [
                    "6호선",
                    "우이신설선"
                ]
            },
            {
                "name": "안암",
                "lat": 37.586272,
                "lng": 127.029005,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "고려대",
                "lat": 37.590508,
                "lng": 127.036296,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "월곡",
                "lat": 37.601948,
                "lng": 127.041518,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "상월곡",
                "lat": 37.606377,
                "lng": 127.048491,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "돌곶이",
                "lat": 37.610537,
                "lng": 127.056431,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "석계",
                "lat": 37.614805,
                "lng": 127.065851,
                "lines": [
                    "1호선",
                    "6호선"
                ]
            },
            {
                "name": "태릉입구",
                "lat": 37.617983,
                "lng": 127.07512,
                "lines": [
                    "6호선",
                    "7호선"
                ]
            },
            {
                "name": "화랑대",
                "lat": 37.620064,
                "lng": 127.084689,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "봉화산",
                "lat": 37.617283,
                "lng": 127.091401,
                "lines": [
                    "6호선"
                ]
            },
            {
                "name": "신내",
                "lat": 37.612887,
                "lng": 127.103218,
                "lines": [
                    "6호선",
                    "경춘선"
                ]
            }
        ]
    },
    {
        "id": "7",
        "name": "7호선",
        "color": "#747F00",
        "stations": [
            {
                "name": "장암",
                "lat": 37.700109,
                "lng": 127.053196,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "도봉산",
                "lat": 37.689313,
                "lng": 127.046222,
                "lines": [
                    "1호선",
                    "7호선"
                ]
            },
            {
                "name": "수락산",
                "lat": 37.67785,
                "lng": 127.055315,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "마들",
                "lat": 37.66494,
                "lng": 127.057675,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "노원",
                "lat": 37.655128,
                "lng": 127.061368,
                "lines": [
                    "4호선",
                    "7호선"
                ]
            },
            {
                "name": "중계",
                "lat": 37.644583,
                "lng": 127.064303,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "하계",
                "lat": 37.636352,
                "lng": 127.06799,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "공릉",
                "lat": 37.625742,
                "lng": 127.072896,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "태릉입구",
                "lat": 37.617983,
                "lng": 127.07512,
                "lines": [
                    "6호선",
                    "7호선"
                ]
            },
            {
                "name": "먹골",
                "lat": 37.610637,
                "lng": 127.077725,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "중화",
                "lat": 37.602545,
                "lng": 127.079264,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "상봉",
                "lat": 37.596362,
                "lng": 127.085032,
                "lines": [
                    "7호선",
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "면목",
                "lat": 37.588579,
                "lng": 127.087503,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "사가정",
                "lat": 37.580894,
                "lng": 127.088478,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "용마산",
                "lat": 37.573647,
                "lng": 127.086727,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "중곡",
                "lat": 37.565923,
                "lng": 127.08432,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "군자",
                "lat": 37.557121,
                "lng": 127.079542,
                "lines": [
                    "5호선",
                    "7호선"
                ]
            },
            {
                "name": "어린이대공원",
                "lat": 37.548014,
                "lng": 127.074658,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "건대입구",
                "lat": 37.540693,
                "lng": 127.07023,
                "lines": [
                    "2호선",
                    "7호선"
                ]
            },
            {
                "name": "뚝섬유원지",
                "lat": 37.53154,
                "lng": 127.066704,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "청담",
                "lat": 37.519365,
                "lng": 127.05335,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "강남구청",
                "lat": 37.517186,
                "lng": 127.04128,
                "lines": [
                    "7호선",
                    "수인분당선"
                ]
            },
            {
                "name": "학동",
                "lat": 37.514229,
                "lng": 127.031656,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "논현",
                "lat": 37.511093,
                "lng": 127.021415,
                "lines": [
                    "7호선",
                    "신분당선"
                ]
            },
            {
                "name": "반포",
                "lat": 37.508178,
                "lng": 127.011727,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "고속터미널",
                "lat": 37.50481,
                "lng": 127.004943,
                "lines": [
                    "3호선",
                    "7호선",
                    "9호선"
                ]
            },
            {
                "name": "내방",
                "lat": 37.487618,
                "lng": 126.993513,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "이수(총신대)",
                "lat": 37.486263,
                "lng": 126.981989,
                "lines": [
                    "4호선",
                    "7호선"
                ]
            },
            {
                "name": "남성",
                "lat": 37.484596,
                "lng": 126.971251,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "숭실대입구",
                "lat": 37.496029,
                "lng": 126.953822,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "상도",
                "lat": 37.502834,
                "lng": 126.94791,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "장승배기",
                "lat": 37.504898,
                "lng": 126.93915,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "신대방삼거리",
                "lat": 37.499701,
                "lng": 126.928276,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "보라매",
                "lat": 37.499900,
                "lng": 126.920200,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "신풍",
                "lat": 37.50008,
                "lng": 126.90993,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "대림",
                "lat": 37.49297,
                "lng": 126.895801,
                "lines": [
                    "2호선",
                    "7호선"
                ]
            },
            {
                "name": "남구로",
                "lat": 37.486056,
                "lng": 126.887249,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "가산디지털단지",
                "lat": 37.481072,
                "lng": 126.882343,
                "lines": [
                    "1호선",
                    "7호선"
                ]
            },
            {
                "name": "철산",
                "lat": 37.47605,
                "lng": 126.867911,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "광명사거리",
                "lat": 37.479252,
                "lng": 126.854876,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "천왕",
                "lat": 37.486637,
                "lng": 126.838713,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "온수",
                "lat": 37.492258,
                "lng": 126.823388,
                "lines": [
                    "1호선",
                    "7호선"
                ]
            },
            {
                "name": "까치울",
                "lat": 37.506207,
                "lng": 126.810939,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "부천종합운동장",
                "lat": 37.50538,
                "lng": 126.797337,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "춘의",
                "lat": 37.503663,
                "lng": 126.787036,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "신중동",
                "lat": 37.503048,
                "lng": 126.77596,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "부천시청",
                "lat": 37.504631,
                "lng": 126.763538,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "상동",
                "lat": 37.505781,
                "lng": 126.753083,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "삼산체육관",
                "lat": 37.506411,
                "lng": 126.742153,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "굴포천",
                "lat": 37.506997,
                "lng": 126.73128,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "부평구청",
                "lat": 37.507442,
                "lng": 126.721393,
                "lines": [
                    "7호선",
                    "인천선"
                ]
            },
            {
                "name": "산곡",
                "lat": 37.508547,
                "lng": 126.703510,
                "lines": [
                    "7호선"
                ]
            },
            {
                "name": "석남",
                "lat": 37.506208,
                "lng": 126.676213,
                "lines": [
                    "인천2호선",
                    "7호선"
                ]
            }
        ]
    },
    {
        "id": "8",
        "name": "8호선",
        "color": "#E6186C",
        "stations": [
            {
                "name": "별내",
                "lat": 37.64202,
                "lng": 127.12684,
                "lines": [
                    "경춘선",
                    "8호선"
                ]
            },
            {
                "name": "다산",
                "lat": 37.62409,
                "lng": 127.14973,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "동구릉",
                "lat": 37.61055,
                "lng": 127.13805,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "구리",
                "lat": 37.603392,
                "lng": 127.143869,
                "lines": [
                    "경의중앙선",
                    "8호선"
                ]
            },
            {
                "name": "장자호수공원",
                "lat": 37.58768,
                "lng": 127.13795,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "암사역사공원",
                "lat": 37.55718,
                "lng": 127.1375,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "암사",
                "lat": 37.55021,
                "lng": 127.127562,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "천호",
                "lat": 37.538397,
                "lng": 127.123572,
                "lines": [
                    "5호선",
                    "8호선"
                ]
            },
            {
                "name": "강동구청",
                "lat": 37.530341,
                "lng": 127.120508,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "몽촌토성",
                "lat": 37.517409,
                "lng": 127.112359,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "잠실",
                "lat": 37.51395,
                "lng": 127.102234,
                "lines": [
                    "2호선",
                    "8호선"
                ]
            },
            {
                "name": "석촌",
                "lat": 37.505431,
                "lng": 127.106979,
                "lines": [
                    "8호선",
                    "9호선"
                ]
            },
            {
                "name": "송파",
                "lat": 37.499703,
                "lng": 127.112183,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "가락시장",
                "lat": 37.492522,
                "lng": 127.118234,
                "lines": [
                    "3호선",
                    "8호선"
                ]
            },
            {
                "name": "문정",
                "lat": 37.485855,
                "lng": 127.1225,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "장지",
                "lat": 37.478703,
                "lng": 127.126191,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "복정",
                "lat": 37.470047,
                "lng": 127.126662,
                "lines": [
                    "8호선",
                    "수인분당선"
                ]
            },
            {
                "name": "산성",
                "lat": 37.457122,
                "lng": 127.149908,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "남한산성입구",
                "lat": 37.451535,
                "lng": 127.159816,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "단대오거리",
                "lat": 37.44521,
                "lng": 127.156866,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "신흥",
                "lat": 37.440918,
                "lng": 127.147564,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "수진",
                "lat": 37.437428,
                "lng": 127.140722,
                "lines": [
                    "8호선"
                ]
            },
            {
                "name": "모란",
                "lat": 37.43213,
                "lng": 127.129087,
                "lines": [
                    "8호선",
                    "수인분당선"
                ]
            }
        ]
    },
    {
        "id": "9",
        "name": "9호선",
        "color": "#BDB092",
        "stations": [
            {
                "name": "개화",
                "lat": 37.578608,
                "lng": 126.798153,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "김포공항",
                "lat": 37.562434,
                "lng": 126.801058,
                "lines": [
                    "5호선",
                    "9호선",
                    "공항철도",
                    "김포도시철도"
                ]
            },
            {
                "name": "마곡나루",
                "lat": 37.567336,
                "lng": 126.829497,
                "lines": [
                    "9호선",
                    "공항철도"
                ]
            },
            {
                "name": "양천향교",
                "lat": 37.568381,
                "lng": 126.841333,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "가양",
                "lat": 37.561391,
                "lng": 126.854456,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "증미",
                "lat": 37.557402,
                "lng": 126.861939,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "등촌",
                "lat": 37.550632,
                "lng": 126.865689,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "염창",
                "lat": 37.546936,
                "lng": 126.874916,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "신목동",
                "lat": 37.544277,
                "lng": 126.88308,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "선유도",
                "lat": 37.53802,
                "lng": 126.893525,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "당산",
                "lat": 37.53438,
                "lng": 126.902281,
                "lines": [
                    "2호선",
                    "9호선"
                ]
            },
            {
                "name": "국회의사당",
                "lat": 37.528105,
                "lng": 126.917874,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "여의도",
                "lat": 37.521569,
                "lng": 126.924256,
                "lines": [
                    "5호선",
                    "9호선"
                ]
            },
            {
                "name": "샛강",
                "lat": 37.517136,
                "lng": 126.929293,
                "lines": [
                    "9호선",
                    "신림선"
                ]
            },
            {
                "name": "노량진",
                "lat": 37.514219,
                "lng": 126.942454,
                "lines": [
                    "1호선",
                    "9호선"
                ]
            },
            {
                "name": "노들",
                "lat": 37.512887,
                "lng": 126.953222,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "흑석",
                "lat": 37.50877,
                "lng": 126.963708,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "동작",
                "lat": 37.502971,
                "lng": 126.979306,
                "lines": [
                    "4호선",
                    "9호선"
                ]
            },
            {
                "name": "구반포",
                "lat": 37.501364,
                "lng": 126.987332,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "신반포",
                "lat": 37.503415,
                "lng": 126.995925,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "고속터미널",
                "lat": 37.50481,
                "lng": 127.004943,
                "lines": [
                    "3호선",
                    "7호선",
                    "9호선"
                ]
            },
            {
                "name": "사평",
                "lat": 37.504206,
                "lng": 127.015259,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "신논현",
                "lat": 37.504598,
                "lng": 127.02506,
                "lines": [
                    "9호선",
                    "신분당선"
                ]
            },
            {
                "name": "언주",
                "lat": 37.507287,
                "lng": 127.033868,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "선정릉",
                "lat": 37.51098,
                "lng": 127.043593,
                "lines": [
                    "9호선",
                    "수인분당선"
                ]
            },
            {
                "name": "삼성중앙",
                "lat": 37.513011,
                "lng": 127.053282,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "봉은사",
                "lat": 37.514219,
                "lng": 127.060245,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "종합운동장",
                "lat": 37.510997,
                "lng": 127.073642,
                "lines": [
                    "2호선",
                    "9호선"
                ]
            },
            {
                "name": "삼전",
                "lat": 37.5046844,
                "lng": 127.0855792,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "석촌고분",
                "lat": 37.5029416,
                "lng": 127.1030796,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "석촌",
                "lat": 37.505431,
                "lng": 127.106979,
                "lines": [
                    "8호선",
                    "9호선"
                ]
            },
            {
                "name": "송파나루",
                "lat": 37.5029584,
                "lng": 127.1030581,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "한성백제",
                "lat": 37.5158598,
                "lng": 127.1171543,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "올림픽공원",
                "lat": 37.516078,
                "lng": 127.130848,
                "lines": [
                    "5호선",
                    "9호선"
                ]
            },
            {
                "name": "둔촌오륜",
                "lat": 37.5193002,
                "lng": 127.136481,
                "lines": [
                    "9호선"
                ]
            },
            {
                "name": "중앙보훈병원",
                "lat": 37.5288832,
                "lng": 127.146342,
                "lines": [
                    "9호선"
                ]
            }
        ]
    },
    {
        "id": "SuinBundang",
        "name": "수인분당선",
        "color": "#F5A200",
        "stations": [
            {
                "name": "인천",
                "lat": 37.476691,
                "lng": 126.616936,
                "lines": [
                    "1호선",
                    "수인분당선"
                ]
            },
            {
                "name": "신포",
                "lat": 37.46874,
                "lng": 126.623853,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "숭의",
                "lat": 37.460789,
                "lng": 126.638297,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "인하대",
                "lat": 37.448493,
                "lng": 126.649619,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "송도",
                "lat": 37.428514,
                "lng": 126.657772,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "연수",
                "lat": 37.417804,
                "lng": 126.67894,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "원인재",
                "lat": 37.412603,
                "lng": 126.687389,
                "lines": [
                    "수인분당선",
                    "인천선"
                ]
            },
            {
                "name": "남동인더스파크",
                "lat": 37.407722,
                "lng": 126.695216,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "호구포",
                "lat": 37.401637,
                "lng": 126.708627,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "인천논현",
                "lat": 37.400614,
                "lng": 126.722478,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "소래포구",
                "lat": 37.40095,
                "lng": 126.733522,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "월곶",
                "lat": 37.391769,
                "lng": 126.742699,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "달월",
                "lat": 37.379681,
                "lng": 126.745177,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "오이도",
                "lat": 37.362357,
                "lng": 126.738714,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "정왕",
                "lat": 37.351735,
                "lng": 126.742989,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "신길온천",
                "lat": 37.338212,
                "lng": 126.765844,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "안산",
                "lat": 37.327082,
                "lng": 126.788532,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "초지",
                "lat": 37.320646,
                "lng": 126.805913,
                "lines": [
                    "4호선",
                    "서해선",
                    "수인분당선"
                ]
            },
            {
                "name": "고잔",
                "lat": 37.316777,
                "lng": 126.823249,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "중앙",
                "lat": 37.315941,
                "lng": 126.838573,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "한대앞",
                "lat": 37.309689,
                "lng": 126.85344,
                "lines": [
                    "4호선",
                    "수인분당선"
                ]
            },
            {
                "name": "사리",
                "lat": 37.29062095298378,
                "lng": 126.85709658864381,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "야목",
                "lat": 37.26139114625711,
                "lng": 126.88378190254757,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "어천",
                "lat": 37.25008693721142,
                "lng": 126.90878536249919,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "오목천",
                "lat": 37.24335646829219,
                "lng": 126.96386677176771,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "고색",
                "lat": 37.24978483062486,
                "lng": 126.98053419002909,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "수원",
                "lat": 37.265974,
                "lng": 126.999874,
                "lines": [
                    "1호선",
                    "수인분당선"
                ]
            },
            {
                "name": "매교",
                "lat": 37.265481,
                "lng": 127.015678,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "수원시청",
                "lat": 37.261911,
                "lng": 127.030736,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "매탄권선",
                "lat": 37.252759,
                "lng": 127.040566,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "망포",
                "lat": 37.245795,
                "lng": 127.057353,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "영통",
                "lat": 37.251568,
                "lng": 127.071394,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "청명",
                "lat": 37.259489,
                "lng": 127.078934,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "상갈",
                "lat": 37.26181,
                "lng": 127.108847,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "기흥",
                "lat": 37.275619,
                "lng": 127.115936,
                "lines": [
                    "수인분당선",
                    "용인경전철"
                ]
            },
            {
                "name": "신갈",
                "lat": 37.286102,
                "lng": 127.111313,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "구성",
                "lat": 37.298969,
                "lng": 127.105664,
                "lines": [
                    "수인분당선",
                    "GTX-A"
                ]
            },
            {
                "name": "보정",
                "lat": 37.312752,
                "lng": 127.108196,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "죽전",
                "lat": 37.324753,
                "lng": 127.107395,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "오리",
                "lat": 37.339824,
                "lng": 127.108942,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "미금",
                "lat": 37.350077,
                "lng": 127.10891,
                "lines": [
                    "수인분당선",
                    "신분당선"
                ]
            },
            {
                "name": "정자",
                "lat": 37.36706,
                "lng": 127.108105,
                "lines": [
                    "수인분당선",
                    "신분당선"
                ]
            },
            {
                "name": "수내",
                "lat": 37.378455,
                "lng": 127.114322,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "서현",
                "lat": 37.385126,
                "lng": 127.123592,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "이매",
                "lat": 37.396104,
                "lng": 127.12827,
                "lines": [
                    "경강선",
                    "수인분당선"
                ]
            },
            {
                "name": "야탑",
                "lat": 37.411185,
                "lng": 127.128715,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "모란",
                "lat": 37.43213,
                "lng": 127.129087,
                "lines": [
                    "8호선",
                    "수인분당선"
                ]
            },
            {
                "name": "태평",
                "lat": 37.440019,
                "lng": 127.127709,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "가천대",
                "lat": 37.448605,
                "lng": 127.126697,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "복정",
                "lat": 37.470047,
                "lng": 127.126662,
                "lines": [
                    "8호선",
                    "수인분당선"
                ]
            },
            {
                "name": "수서",
                "lat": 37.487371,
                "lng": 127.10188,
                "lines": [
                    "3호선",
                    "수인분당선",
                    "GTX-A"
                ]
            },
            {
                "name": "대모산입구",
                "lat": 37.491373,
                "lng": 127.07272,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "개포동",
                "lat": 37.489116,
                "lng": 127.06614,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "구룡",
                "lat": 37.486839,
                "lng": 127.058856,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "도곡",
                "lat": 37.490858,
                "lng": 127.055381,
                "lines": [
                    "3호선",
                    "수인분당선"
                ]
            },
            {
                "name": "한티",
                "lat": 37.496237,
                "lng": 127.052873,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "선릉",
                "lat": 37.504503,
                "lng": 127.049008,
                "lines": [
                    "2호선",
                    "수인분당선"
                ]
            },
            {
                "name": "선정릉",
                "lat": 37.51098,
                "lng": 127.043593,
                "lines": [
                    "9호선",
                    "수인분당선"
                ]
            },
            {
                "name": "강남구청",
                "lat": 37.517186,
                "lng": 127.04128,
                "lines": [
                    "7호선",
                    "수인분당선"
                ]
            },
            {
                "name": "압구정로데오",
                "lat": 37.527381,
                "lng": 127.040534,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "서울숲",
                "lat": 37.543617,
                "lng": 127.044707,
                "lines": [
                    "수인분당선"
                ]
            },
            {
                "name": "왕십리",
                "lat": 37.561533,
                "lng": 127.037732,
                "lines": [
                    "2호선",
                    "5호선",
                    "경의중앙선",
                    "수인분당선"
                ]
            },
            {
                "name": "청량리",
                "lat": 37.580178,
                "lng": 127.046835,
                "lines": [
                    "1호선",
                    "경의중앙선",
                    "경춘선",
                    "수인분당선"
                ]
            }
        ]
    },
    {
        "id": "Arex",
        "name": "공항철도",
        "color": "#0090D2",
        "stations": [
            {
                "name": "인천공항2터미널",
                "lat": 37.4848197,
                "lng": 126.4374223,
                "lines": [
                    "공항철도"
                ]
            },
            {
                "name": "인천공항1터미널",
                "lat": 37.4475222,
                "lng": 126.4503834,
                "lines": [
                    "공항철도",
                    "자기부상철도"
                ]
            },
            {
                "name": "공항화물청사",
                "lat": 37.458366,
                "lng": 126.476241,
                "lines": [
                    "공항철도"
                ]
            },
            {
                "name": "운서",
                "lat": 37.492904,
                "lng": 126.49379,
                "lines": [
                    "공항철도"
                ]
            },
            {
                "name": "영종",
                "lat": 37.511466,
                "lng": 126.5237,
                "lines": [
                    "공항철도"
                ]
            },
            {
                "name": "청라국제도시",
                "lat": 37.555878,
                "lng": 126.625327,
                "lines": [
                    "공항철도"
                ]
            },
            {
                "name": "검암",
                "lat": 37.569104,
                "lng": 126.673728,
                "lines": [
                    "공항철도",
                    "인천2호선"
                ]
            },
            {
                "name": "계양",
                "lat": 37.571462,
                "lng": 126.735637,
                "lines": [
                    "공항철도",
                    "인천선"
                ]
            },
            {
                "name": "김포공항",
                "lat": 37.562434,
                "lng": 126.801058,
                "lines": [
                    "5호선",
                    "9호선",
                    "공항철도",
                    "김포도시철도"
                ]
            },
            {
                "name": "마곡나루",
                "lat": 37.567336,
                "lng": 126.829497,
                "lines": [
                    "9호선",
                    "공항철도"
                ]
            },
            {
                "name": "디지털미디어시티",
                "lat": 37.576646,
                "lng": 126.900984,
                "lines": [
                    "6호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "가좌",
                "lat": 37.568491,
                "lng": 126.915487,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "홍대입구",
                "lat": 37.557192,
                "lng": 126.925381,
                "lines": [
                    "2호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "서강대",
                "lat": 37.551608,
                "lng": 126.936733,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "공덕",
                "lat": 37.544018,
                "lng": 126.951592,
                "lines": [
                    "5호선",
                    "6호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "서울",
                "lat": 37.554648,
                "lng": 126.972559,
                "lines": [
                    "1호선",
                    "4호선",
                    "경의중앙선",
                    "공항철도",
                    "GTX-A"
                ]
            }
        ]
    },
    {
        "id": "Gyeongchun",
        "name": "경춘선",
        "color": "#175C30",
        "stations": [
            {
                "name": "청량리",
                "lat": 37.580178,
                "lng": 127.046835,
                "lines": [
                    "1호선",
                    "경의중앙선",
                    "경춘선",
                    "수인분당선"
                ]
            },
            {
                "name": "회기",
                "lat": 37.58946,
                "lng": 127.057583,
                "lines": [
                    "1호선",
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "중랑",
                "lat": 37.594917,
                "lng": 127.076116,
                "lines": [
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "상봉",
                "lat": 37.596362,
                "lng": 127.085032,
                "lines": [
                    "7호선",
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "망우",
                "lat": 37.59955,
                "lng": 127.091909,
                "lines": [
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "신내",
                "lat": 37.612887,
                "lng": 127.103218,
                "lines": [
                    "6호선",
                    "경춘선"
                ]
            },
            {
                "name": "갈매",
                "lat": 37.634118,
                "lng": 127.114757,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "별내",
                "lat": 37.64202,
                "lng": 127.12684,
                "lines": [
                    "경춘선",
                    "8호선"
                ]
            },
            {
                "name": "퇴계원",
                "lat": 37.648311,
                "lng": 127.143952,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "사릉",
                "lat": 37.65108,
                "lng": 127.176933,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "금곡",
                "lat": 37.637382,
                "lng": 127.207853,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "평내호평",
                "lat": 37.653225,
                "lng": 127.244493,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "천마산",
                "lat": 37.658978,
                "lng": 127.285379,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "마석",
                "lat": 37.652782,
                "lng": 127.311767,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "대성리",
                "lat": 37.684071,
                "lng": 127.379319,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "청평",
                "lat": 37.735488,
                "lng": 127.42661,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "상천",
                "lat": 37.770246,
                "lng": 127.454821,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "가평",
                "lat": 37.814536,
                "lng": 127.510739,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "굴봉산",
                "lat": 37.832067,
                "lng": 127.557695,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "백양리",
                "lat": 37.830779,
                "lng": 127.58933,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "강촌",
                "lat": 37.805723,
                "lng": 127.634146,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "김유정",
                "lat": 37.818466,
                "lng": 127.71434,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "남춘천",
                "lat": 37.864007,
                "lng": 127.723792,
                "lines": [
                    "경춘선"
                ]
            },
            {
                "name": "춘천",
                "lat": 37.885054,
                "lng": 127.717023,
                "lines": [
                    "경춘선"
                ]
            }
        ]
    },
    {
        "id": "Shinbundang",
        "name": "신분당선",
        "color": "#D4003B",
        "stations": [
            {
                "name": "신사",
                "lat": 37.516334,
                "lng": 127.020114,
                "lines": [
                    "3호선",
                    "신분당선"
                ]
            },
            {
                "name": "논현",
                "lat": 37.511093,
                "lng": 127.021415,
                "lines": [
                    "7호선",
                    "신분당선"
                ]
            },
            {
                "name": "신논현",
                "lat": 37.504598,
                "lng": 127.02506,
                "lines": [
                    "9호선",
                    "신분당선"
                ]
            },
            {
                "name": "강남",
                "lat": 37.497175,
                "lng": 127.027926,
                "lines": [
                    "2호선",
                    "신분당선"
                ]
            },
            {
                "name": "양재",
                "lat": 37.484147,
                "lng": 127.034631,
                "lines": [
                    "3호선",
                    "신분당선"
                ]
            },
            {
                "name": "양재시민의숲",
                "lat": 37.470023,
                "lng": 127.03842,
                "lines": [
                    "신분당선"
                ]
            },
            {
                "name": "청계산입구",
                "lat": 37.447211,
                "lng": 127.055664,
                "lines": [
                    "신분당선"
                ]
            },
            {
                "name": "판교",
                "lat": 37.394761,
                "lng": 127.111217,
                "lines": [
                    "경강선",
                    "신분당선"
                ]
            },
            {
                "name": "정자",
                "lat": 37.36706,
                "lng": 127.108105,
                "lines": [
                    "수인분당선",
                    "신분당선"
                ]
            },
            {
                "name": "미금",
                "lat": 37.350077,
                "lng": 127.10891,
                "lines": [
                    "수인분당선",
                    "신분당선"
                ]
            },
            {
                "name": "동천",
                "lat": 37.337928,
                "lng": 127.102976,
                "lines": [
                    "신분당선"
                ]
            },
            {
                "name": "수지구청",
                "lat": 37.322702,
                "lng": 127.095026,
                "lines": [
                    "신분당선"
                ]
            },
            {
                "name": "성복",
                "lat": 37.313335,
                "lng": 127.0801,
                "lines": [
                    "신분당선"
                ]
            },
            {
                "name": "상현",
                "lat": 37.297664,
                "lng": 127.069342,
                "lines": [
                    "신분당선"
                ]
            },
            {
                "name": "광교중앙",
                "lat": 37.288617,
                "lng": 127.051478,
                "lines": [
                    "신분당선"
                ]
            },
            {
                "name": "광교",
                "lat": 37.30211,
                "lng": 127.044483,
                "lines": [
                    "신분당선"
                ]
            }
        ]
    },
    {
        "id": "UiSinseol",
        "name": "우이신설선",
        "color": "#B0CE18",
        "stations": [
            {
                "name": "북한산우이",
                "lat": 37.663146,
                "lng": 127.012789,
                "lines": [
                    "우이신설선"
                ]
            },
            {
                "name": "성신여대입구",
                "lat": 37.592624,
                "lng": 127.016403,
                "lines": [
                    "4호선",
                    "우이신설선"
                ]
            },
            {
                "name": "신설동",
                "lat": 37.575297,
                "lng": 127.025087,
                "lines": [
                    "1호선",
                    "2호선",
                    "우이신설선"
                ]
            }
        ]
    },
    {
        "id": "GTX-A",
        "name": "GTX-A",
        "color": "#742542",
        "stations": [
            {
                "name": "운정중앙",
                "lat": 37.7142,
                "lng": 126.6974,
                "lines": ["GTX-A"]
            },
            {
                "name": "킨텍스",
                "lat": 37.6685,
                "lng": 126.7482,
                "lines": ["GTX-A"]
            },
            {
                "name": "대곡",
                "lat": 37.631626,
                "lng": 126.811024,
                "lines": ["3호선", "경의중앙선", "서해선", "GTX-A"]
            },
            {
                "name": "연신내",
                "lat": 37.6189,
                "lng": 126.9205,
                "lines": ["3호선", "6호선", "GTX-A"]
            },
            {
                "name": "서울",
                "lat": 37.554648,
                "lng": 126.972559,
                "lines": ["1호선", "4호선", "경의중앙선", "공항철도", "GTX-A"]
            },
            {
                "name": "수서",
                "lat": 37.487371,
                "lng": 127.10188,
                "lines": ["3호선", "수인분당선", "GTX-A"]
            },
            {
                "name": "성남",
                "lat": 37.3947,
                "lng": 127.1112,
                "lines": ["경강선", "GTX-A"]
            },
            {
                "name": "구성",
                "lat": 37.298969,
                "lng": 127.105664,
                "lines": ["수인분당선", "GTX-A"]
            },
            {
                "name": "동탄",
                "lat": 37.1994,
                "lng": 127.0965,
                "lines": ["GTX-A"]
            }
        ]
    },
    {
        "id": "Gyeongui-Main",
        "name": "경의중앙선",
        "color": "#77C4A3",
        "stations": [
            {
                "name": "문산",
                "lat": 37.854619,
                "lng": 126.788047,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "파주",
                "lat": 37.815298,
                "lng": 126.792783,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "월롱",
                "lat": 37.796188,
                "lng": 126.792587,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "금촌",
                "lat": 37.766217,
                "lng": 126.774644,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "금릉",
                "lat": 37.751322,
                "lng": 126.765347,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "운정",
                "lat": 37.725826,
                "lng": 126.767257,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "야당",
                "lat": 37.712327,
                "lng": 126.761356,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "탄현",
                "lat": 37.694023,
                "lng": 126.761086,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "일산",
                "lat": 37.682077,
                "lng": 126.769846,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "풍산",
                "lat": 37.672346,
                "lng": 126.786243,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "백마",
                "lat": 37.658239,
                "lng": 126.794461,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "곡산",
                "lat": 37.645676,
                "lng": 126.801762,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "대곡",
                "lat": 37.631626,
                "lng": 126.811024,
                "lines": [
                    "3호선",
                    "경의중앙선",
                    "GTX-A"
                ]
            },
            {
                "name": "능곡",
                "lat": 37.618808,
                "lng": 126.820783,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "행신",
                "lat": 37.612102,
                "lng": 126.834146,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "강매",
                "lat": 37.612314,
                "lng": 126.843223,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "화전",
                "lat": 37.602888,
                "lng": 126.868387,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "수색",
                "lat": 37.580842,
                "lng": 126.895611,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "디지털미디어시티",
                "lat": 37.576646,
                "lng": 126.900984,
                "lines": [
                    "6호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "가좌",
                "lat": 37.568491,
                "lng": 126.915487,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "홍대입구",
                "lat": 37.557192,
                "lng": 126.925381,
                "lines": [
                    "2호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "서강대",
                "lat": 37.551608,
                "lng": 126.936733,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "공덕",
                "lat": 37.544018,
                "lng": 126.951592,
                "lines": [
                    "5호선",
                    "6호선",
                    "경의중앙선",
                    "공항철도"
                ]
            },
            {
                "name": "효창공원앞",
                "lat": 37.539261,
                "lng": 126.961351,
                "lines": [
                    "6호선",
                    "경의중앙선"
                ]
            },
            {
                "name": "용산",
                "lat": 37.529849,
                "lng": 126.964561,
                "lines": [
                    "1호선",
                    "경의중앙선"
                ]
            },
            {
                "name": "이촌",
                "lat": 37.522272,
                "lng": 126.974345,
                "lines": [
                    "4호선",
                    "경의중앙선"
                ]
            },
            {
                "name": "서빙고",
                "lat": 37.519594,
                "lng": 126.988537,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "한남",
                "lat": 37.52943,
                "lng": 127.009169,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "옥수",
                "lat": 37.540685,
                "lng": 127.017965,
                "lines": [
                    "3호선",
                    "경의중앙선"
                ]
            },
            {
                "name": "응봉",
                "lat": 37.549946,
                "lng": 127.034538,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "왕십리",
                "lat": 37.561533,
                "lng": 127.037732,
                "lines": [
                    "2호선",
                    "5호선",
                    "경의중앙선",
                    "수인분당선"
                ]
            },
            {
                "name": "청량리",
                "lat": 37.580178,
                "lng": 127.046835,
                "lines": [
                    "1호선",
                    "경의중앙선",
                    "경춘선",
                    "수인분당선"
                ]
            },
            {
                "name": "회기",
                "lat": 37.58946,
                "lng": 127.057583,
                "lines": [
                    "1호선",
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "중랑",
                "lat": 37.594917,
                "lng": 127.076116,
                "lines": [
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "상봉",
                "lat": 37.596362,
                "lng": 127.085032,
                "lines": [
                    "7호선",
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "망우",
                "lat": 37.59955,
                "lng": 127.091909,
                "lines": [
                    "경의중앙선",
                    "경춘선"
                ]
            },
            {
                "name": "양원",
                "lat": 37.606596,
                "lng": 127.107906,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "구리",
                "lat": 37.603392,
                "lng": 127.143869,
                "lines": [
                    "경의중앙선",
                    "8호선"
                ]
            },
            {
                "name": "도농",
                "lat": 37.608806,
                "lng": 127.161153,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "양정",
                "lat": 37.60533,
                "lng": 127.19364,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "덕소",
                "lat": 37.586781,
                "lng": 127.208832,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "도심",
                "lat": 37.579622,
                "lng": 127.222672,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "팔당",
                "lat": 37.547371,
                "lng": 127.243939,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "운길산",
                "lat": 37.554669,
                "lng": 127.310115,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "양수",
                "lat": 37.545981,
                "lng": 127.329098,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "신원",
                "lat": 37.525545,
                "lng": 127.372921,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "국수",
                "lat": 37.516169,
                "lng": 127.399367,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "아신",
                "lat": 37.51382,
                "lng": 127.443173,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "오빈",
                "lat": 37.506062,
                "lng": 127.473868,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "양평(경의중앙선)",
                "lat": 37.492695677260684,
                "lng": 127.49222959342376,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "원덕",
                "lat": 37.468672,
                "lng": 127.547076,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "용문",
                "lat": 37.48223,
                "lng": 127.594647,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "지평",
                "lat": 37.476444,
                "lng": 127.629617,
                "lines": [
                    "경의중앙선"
                ]
            }
        ]
    },
    {
        "id": "Gyeongui-Seoul",
        "name": "경의중앙선",
        "color": "#77C4A3",
        "stations": [
            {
                "name": "가좌",
                "lat": 37.568491,
                "lng": 126.915487,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "신촌(경의선)",
                "lat": 37.5584701,
                "lng": 126.9387193,
                "lines": [
                    "경의중앙선"
                ]
            },
            {
                "name": "서울",
                "lat": 37.554648,
                "lng": 126.972559,
                "lines": [
                    "1호선",
                    "4호선",
                    "경의중앙선",
                    "공항철도",
                    "GTX-A"
                ]
            }
        ]
    },
    {
        "id": "Incheon-2",
        "name": "인천2호선",
        "color": "#ED8B00",
        "stations": [
            { "name": "검단오류", "lat": 37.5948, "lng": 126.6272, "lines": ["인천2호선"] },
            { "name": "왕길", "lat": 37.5915, "lng": 126.6433, "lines": ["인천2호선"] },
            { "name": "검단사거리", "lat": 37.6021, "lng": 126.6611, "lines": ["인천2호선"] },
            { "name": "마전", "lat": 37.5976, "lng": 126.6713, "lines": ["인천2호선"] },
            { "name": "완정", "lat": 37.5928, "lng": 126.6734, "lines": ["인천2호선"] },
            { "name": "독정", "lat": 37.5857, "lng": 126.6728, "lines": ["인천2호선"] },
            { "name": "검암", "lat": 37.5691, "lng": 126.6732, "lines": ["인천2호선", "공항철도"] },
            { "name": "검바위", "lat": 37.5612, "lng": 126.6781, "lines": ["인천2호선"] },
            { "name": "아시아드경기장", "lat": 37.5524, "lng": 126.6731, "lines": ["인천2호선"] },
            { "name": "서구청", "lat": 37.5451, "lng": 126.6749, "lines": ["인천2호선"] },
            { "name": "가정", "lat": 37.5251, "lng": 126.6751, "lines": ["인천2호선"] },
            { "name": "가정중앙시장", "lat": 37.5171, "lng": 126.6761, "lines": ["인천2호선"] },
            { "name": "석남", "lat": 37.5065, "lng": 126.6761, "lines": ["인천2호선", "7호선"] },
            { "name": "서부여성회관", "lat": 37.4981, "lng": 126.6771, "lines": ["인천2호선"] },
            { "name": "인천가좌", "lat": 37.4891, "lng": 126.6781, "lines": ["인천2호선"] },
            { "name": "가재울", "lat": 37.4831, "lng": 126.6831, "lines": ["인천2호선"] },
            { "name": "주안국가산단", "lat": 37.4761, "lng": 126.6821, "lines": ["인천2호선"] },
            { "name": "주안", "lat": 37.4651, "lng": 126.6791, "lines": ["1호선", "인천2호선"] },
            { "name": "시민공원", "lat": 37.4581, "lng": 126.6811, "lines": ["인천2호선"] },
            { "name": "석바위시장", "lat": 37.4581, "lng": 126.6921, "lines": ["인천2호선"] },
            { "name": "인천시청", "lat": 37.4561, "lng": 126.7052, "lines": ["인천1호선", "인천2호선"] },
            { "name": "석천사거리", "lat": 37.4591, "lng": 126.7121, "lines": ["인천2호선"] },
            { "name": "모래내시장", "lat": 37.4652, "lng": 126.7230, "lines": ["인천2호선"] },
            { "name": "만수", "lat": 37.4551, "lng": 126.7321, "lines": ["인천2호선"] },
            { "name": "남동구청", "lat": 37.4471, "lng": 126.7411, "lines": ["인천2호선"] },
            { "name": "인천대공원", "lat": 37.4431, "lng": 126.7591, "lines": ["인천2호선"] },
            { "name": "운연", "lat": 37.4401, "lng": 126.7691, "lines": ["인천2호선"] }
        ]
    },
    {
        "id": "Sillim",
        "name": "신림선",
        "color": "#6789CA",
        "stations": [
            { "name": "샛강", "lat": 37.517136, "lng": 126.929293, "lines": ["9호선", "신림선"] },
            { "name": "대방", "lat": 37.513400, "lng": 126.925800, "lines": ["1호선", "신림선"] },
            { "name": "서울지방병무청", "lat": 37.506046, "lng": 126.922708, "lines": ["신림선"] },
            { "name": "보라매", "lat": 37.499900, "lng": 126.920200, "lines": ["7호선", "신림선"] },
            { "name": "보라매공원", "lat": 37.495400, "lng": 126.918300, "lines": ["신림선"] },
            { "name": "보라매병원", "lat": 37.493900, "lng": 126.920900, "lines": ["신림선"] },
            { "name": "당곡", "lat": 37.489128, "lng": 126.924855, "lines": ["신림선"] },
            { "name": "신림", "lat": 37.484200, "lng": 126.929500, "lines": ["2호선", "신림선"] },
            { "name": "서원", "lat": 37.478400, "lng": 126.932800, "lines": ["신림선"] },
            { "name": "서울대벤처타운", "lat": 37.472059, "lng": 126.933892, "lines": ["신림선"] },
            { "name": "관악산", "lat": 37.468200, "lng": 126.945100, "lines": ["신림선"] }
        ]
    },
    {
        "id": "Gyeonggang",
        "name": "경강선",
        "color": "#003DA5",
        "stations": [
            { "name": "판교", "lat": 37.3941, "lng": 127.1112, "lines": ["신분당선", "경강선"] },
            { "name": "성남", "lat": 37.3947, "lng": 127.1112, "lines": ["경강선", "GTX-A"] },
            { "name": "이매", "lat": 37.3951, "lng": 127.1281, "lines": ["수인분당선", "경강선"] },
            { "name": "삼동", "lat": 37.3851, "lng": 127.1851, "lines": ["경강선"] },
            { "name": "경기광주", "lat": 37.3891, "lng": 127.2431, "lines": ["경강선"] },
            { "name": "초월", "lat": 37.3741, "lng": 127.3011, "lines": ["경강선"] },
            { "name": "곤지암", "lat": 37.3511, "lng": 127.3461, "lines": ["경강선"] },
            { "name": "신둔도예촌", "lat": 37.3171, "lng": 127.4041, "lines": ["경강선"] },
            { "name": "이천", "lat": 37.2651, "lng": 127.4411, "lines": ["경강선"] },
            { "name": "부발", "lat": 37.2601, "lng": 127.4911, "lines": ["경강선"] },
            { "name": "세종대왕릉", "lat": 37.2881, "lng": 127.5611, "lines": ["경강선"] },
            { "name": "여주", "lat": 37.2811, "lng": 127.6281, "lines": ["경강선"] }
        ]
    },
    {
        "id": "Seohae",
        "name": "서해선",
        "color": "#8FC31F",
        "stations": [
            { "name": "일산", "lat": 37.6821, "lng": 126.7698, "lines": ["경의중앙선", "서해선"] },
            { "name": "풍산", "lat": 37.6723, "lng": 126.7862, "lines": ["경의중앙선", "서해선"] },
            { "name": "백마", "lat": 37.6582, "lng": 126.7944, "lines": ["경의중앙선", "서해선"] },
            { "name": "곡산", "lat": 37.6457, "lng": 126.8018, "lines": ["경의중앙선", "서해선"] },
            { "name": "대곡", "lat": 37.631626, "lng": 126.811024, "lines": ["3호선", "경의중앙선", "GTX-A", "서해선"] },
            { "name": "능곡", "lat": 37.6188, "lng": 126.8208, "lines": ["경의중앙선", "서해선"] },
            { "name": "김포공항", "lat": 37.5618, "lng": 126.8018, "lines": ["5호선", "9호선", "공항철도", "김포골드라인", "서해선"] },
            { "name": "원종", "lat": 37.5311, "lng": 126.8141, "lines": ["서해선"] },
            { "name": "부천종합운동장", "lat": 37.5051, "lng": 126.7971, "lines": ["7호선", "서해선"] },
            { "name": "소사", "lat": 37.4828, "lng": 126.7954, "lines": ["1호선", "서해선"] },
            { "name": "소새울", "lat": 37.4671, "lng": 126.7931, "lines": ["서해선"] },
            { "name": "시흥대야", "lat": 37.4521, "lng": 126.7841, "lines": ["서해선"] },
            { "name": "신천", "lat": 37.4421, "lng": 126.7811, "lines": ["서해선"] },
            { "name": "신현",     "lat": 37.4060, "lng": 126.7819, "lines": ["서해선"] },
            { "name": "시흥시청",  "lat": 37.3799, "lng": 126.8032, "lines": ["서해선"] },
            { "name": "시흥능곡",  "lat": 37.3578, "lng": 126.8097, "lines": ["서해선"] },
            { "name": "달미",     "lat": 37.3395, "lng": 126.8025, "lines": ["서해선"] },
            { "name": "선부",     "lat": 37.3264, "lng": 126.7906, "lines": ["서해선"] },
            { "name": "초지",     "lat": 37.3151, "lng": 126.7976, "lines": ["4호선", "수인분당선", "서해선"] },
            { "name": "시우",     "lat": 37.2987, "lng": 126.7904, "lines": ["서해선"] },
            { "name": "원시",     "lat": 37.2834, "lng": 126.7786, "lines": ["서해선"] }
        ]
    },
    {
        "id": "GimpoGold",
        "name": "김포골드라인",
        "color": "#A17800",
        "stations": [
            { "name": "양촌", "lat": 37.6411, "lng": 126.6011, "lines": ["김포골드라인"] },
            { "name": "구래", "lat": 37.6421, "lng": 126.6211, "lines": ["김포골드라인"] },
            { "name": "마산", "lat": 37.6431, "lng": 126.6431, "lines": ["김포골드라인"] },
            { "name": "장기", "lat": 37.6411, "lng": 126.6661, "lines": ["김포골드라인"] },
            { "name": "운양", "lat": 37.6361, "lng": 126.6851, "lines": ["김포골드라인"] },
            { "name": "걸포북변", "lat": 37.6311, "lng": 126.7111, "lines": ["김포골드라인"] },
            { "name": "사우",     "lat": 37.6292, "lng": 126.7187, "lines": ["김포골드라인"] },
            { "name": "풍무",     "lat": 37.6202, "lng": 126.7285, "lines": ["김포골드라인"] },
            { "name": "고촌", "lat": 37.6011, "lng": 126.7611, "lines": ["김포골드라인"] },
            { "name": "김포공항", "lat": 37.5618, "lng": 126.8018, "lines": ["5호선", "9호선", "공항철도", "김포골드라인", "서해선"] }
        ]
    },
    {
        "id": "Everline",
        "name": "용인경전철",
        "color": "#5FB04B",
        "stations": [
            { "name": "기흥", "lat": 37.2751, "lng": 127.1151, "lines": ["수인분당선", "용인경전철"] },
            { "name": "상갈", "lat": 37.2651, "lng": 127.1211, "lines": ["용인경전철"] },
            { "name": "강남대", "lat": 37.2611, "lng": 127.1321, "lines": ["용인경전철"] },
            { "name": "지석", "lat": 37.2651, "lng": 127.1451, "lines": ["용인경전철"] },
            { "name": "어정", "lat": 37.2711, "lng": 127.1561, "lines": ["용인경전철"] },
            { "name": "동백", "lat": 37.2751, "lng": 127.1711, "lines": ["용인경전철"] },
            { "name": "초당", "lat": 37.2711, "lng": 127.1851, "lines": ["용인경전철"] },
            { "name": "삼가", "lat": 37.2411, "lng": 127.1711, "lines": ["용인경전철"] },
            { "name": "용인시청",   "lat": 37.2382, "lng": 127.1978, "lines": ["용인경전철"] },
            { "name": "명지대",    "lat": 37.2338, "lng": 127.2012, "lines": ["용인경전철"] },
            { "name": "역북",     "lat": 37.2304, "lng": 127.2083, "lines": ["용인경전철"] },
            { "name": "김량장",   "lat": 37.2304, "lng": 127.2163, "lines": ["용인경전철"] },
            { "name": "용인중앙시장", "lat": 37.2311, "lng": 127.2211, "lines": ["용인경전철"] },
            { "name": "고진", "lat": 37.2351, "lng": 127.2351, "lines": ["용인경전철"] },
            { "name": "보평", "lat": 37.2451, "lng": 127.2311, "lines": ["용인경전철"] },
            { "name": "둔전", "lat": 37.2611, "lng": 127.2211, "lines": ["용인경전철"] },
            { "name": "전대.에버랜드", "lat": 37.2811, "lng": 127.2211, "lines": ["용인경전철"] }
        ]
    },
    {
        "id": "Incheon-1",
        "name": "인천1호선",
        "color": "#7CA8D5",
        "stations": [
            { "name": "계양",          "lat": 37.5702, "lng": 126.7385, "lines": ["공항철도", "인천1호선"] },
            { "name": "귤현",          "lat": 37.5602, "lng": 126.7419, "lines": ["인천1호선"] },
            { "name": "임학",          "lat": 37.5452, "lng": 126.7308, "lines": ["인천1호선"] },
            { "name": "계산",          "lat": 37.5380, "lng": 126.7219, "lines": ["인천1호선"] },
            { "name": "경인교대입구",  "lat": 37.5325, "lng": 126.7143, "lines": ["인천1호선"] },
            { "name": "작전",          "lat": 37.5278, "lng": 126.7159, "lines": ["인천1호선"] },
            { "name": "갈산",          "lat": 37.5165, "lng": 126.7194, "lines": ["인천1호선"] },
            { "name": "부평구청",      "lat": 37.5066, "lng": 126.7234, "lines": ["7호선", "인천1호선"] },
            { "name": "부평시장",      "lat": 37.4994, "lng": 126.7257, "lines": ["인천1호선"] },
            { "name": "부평",          "lat": 37.4895, "lng": 126.7248, "lines": ["1호선", "인천1호선"] },
            { "name": "동수",          "lat": 37.4832, "lng": 126.7254, "lines": ["인천1호선"] },
            { "name": "부평삼거리",    "lat": 37.4756, "lng": 126.7197, "lines": ["인천1호선"] },
            { "name": "간석오거리",    "lat": 37.4668, "lng": 126.7048, "lines": ["인천1호선"] },
            { "name": "인천시청",      "lat": 37.4561, "lng": 126.7052, "lines": ["인천1호선", "인천2호선"] },
            { "name": "예술회관",      "lat": 37.4459, "lng": 126.7002, "lines": ["인천1호선"] },
            { "name": "인천터미널",    "lat": 37.4360, "lng": 126.6886, "lines": ["인천1호선"] },
            { "name": "문학경기장",    "lat": 37.4264, "lng": 126.6784, "lines": ["인천1호선"] },
            { "name": "선학",          "lat": 37.4109, "lng": 126.6794, "lines": ["인천1호선"] },
            { "name": "신연수",        "lat": 37.4033, "lng": 126.6748, "lines": ["인천1호선"] },
            { "name": "동춘",          "lat": 37.4047, "lng": 126.6683, "lines": ["인천1호선"] },
            { "name": "동막",          "lat": 37.3976, "lng": 126.6644, "lines": ["인천1호선"] },
            { "name": "원인재",        "lat": 37.3941, "lng": 126.6622, "lines": ["수인분당선", "인천1호선"] },
            { "name": "캠퍼스타운",    "lat": 37.3878, "lng": 126.6558, "lines": ["인천1호선"] },
            { "name": "테크노파크",    "lat": 37.3823, "lng": 126.6493, "lines": ["인천1호선"] },
            { "name": "지식정보단지",  "lat": 37.3789, "lng": 126.6390, "lines": ["인천1호선"] },
            { "name": "인천대입구",    "lat": 37.3860, "lng": 126.6275, "lines": ["인천1호선"] },
            { "name": "센트럴파크",    "lat": 37.3930, "lng": 126.6220, "lines": ["인천1호선"] },
            { "name": "국제업무지구",  "lat": 37.3999, "lng": 126.6161, "lines": ["인천1호선"] },
            { "name": "송도달빛축제공원", "lat": 37.4043, "lng": 126.6115, "lines": ["인천1호선"] }
        ]
    },
    {
        "id": "Uijeongbu",
        "name": "의정부경전철",
        "color": "#F0A710",
        "stations": [
            { "name": "발곡", "lat": 37.7251, "lng": 127.0511, "lines": ["의정부경전철"] },
            { "name": "회룡", "lat": 37.7248, "lng": 127.0469, "lines": ["1호선", "의정부경전철"] },
            { "name": "범골", "lat": 37.7311, "lng": 127.0411, "lines": ["의정부경전철"] },
            { "name": "경전철의정부", "lat": 37.7351, "lng": 127.0351, "lines": ["의정부경전철"] },
            { "name": "의정부시청", "lat": 37.7391, "lng": 127.0311, "lines": ["의정부경전철"] },
            { "name": "흥선", "lat": 37.7451, "lng": 127.0311, "lines": ["의정부경전철"] },
            { "name": "의정부중앙", "lat": 37.7451, "lng": 127.0451, "lines": ["의정부경전철"] },
            { "name": "동오",            "lat": 37.7520, "lng": 127.0723, "lines": ["의정부경전철"] },
            { "name": "새말",            "lat": 37.7574, "lng": 127.0771, "lines": ["의정부경전철"] },
            { "name": "경기도청북부청사",  "lat": 37.7620, "lng": 127.0818, "lines": ["의정부경전철"] },
            { "name": "효자", "lat": 37.7491, "lng": 127.0851, "lines": ["의정부경전철"] },
            { "name": "곤제", "lat": 37.7451, "lng": 127.0911, "lines": ["의정부경전철"] },
            { "name": "어룡", "lat": 37.7351, "lng": 127.0951, "lines": ["의정부경전철"] },
            { "name": "송산", "lat": 37.7311, "lng": 127.1011, "lines": ["의정부경전철"] },
            { "name": "탑석", "lat": 37.7351, "lng": 127.1151, "lines": ["의정부경전철"] }
        ]
    }
];

// Module-level cache — built once at import time
let _allStationsCache: Station[] | null = null;

export function getAllStations(): Station[] {
    if (_allStationsCache) return _allStationsCache;
    const map = new Map<string, Station>();
    SUBWAY_LINES.forEach(line => {
        line.stations.forEach(station => {
            if (!map.has(station.name)) {
                map.set(station.name, station);
            } else {
                const existing = map.get(station.name)!;
                const mergedLines = Array.from(new Set([...existing.lines, ...station.lines]));
                existing.lines = mergedLines;
            }
        });
    });
    _allStationsCache = Array.from(map.values());
    return _allStationsCache;
}

// Pre-built name→station lookup for O(1) access
let _stationByName: Map<string, Station> | null = null;
export function getStationByName(name: string): Station | undefined {
    if (!_stationByName) {
        _stationByName = new Map(getAllStations().map(s => [s.name, s]));
    }
    return _stationByName.get(name);
}
